# Visit http://macappstore.org to understand & disable the application which are not need for your system

# Install zsh.
# Note: don’t forget to add `/usr/local/bin/zsh` to `/etc/shells` before
# running `chsh`.
brew 'zsh'
brew 'zsh-autosuggestions'
brew 'zsh-completions'
brew 'zsh-history-substring-search'
brew 'zsh-lovers'
brew 'zsh-you-should-use'
brew 'zsh-syntax-highlighting'
brew 'zsh-navigation-tools'
brew 'zsh-git-prompt'

# Install GnuPG to enable PGP-signing commits.
brew 'gnupg'

# Install more recent versions of some macOS tools.
brew 'vim'
brew 'grep'
brew 'openssh'
brew 'php'
brew 'gmp'

# Install font tools.
tap 'bramstein/webfonttools'
brew 'sfnt2woff'
brew 'sfnt2woff-zopfli'
brew 'woff2'

# Install other useful binaries.
brew 'composer'
brew 'curl'
brew 'git'
brew 'git-lfs'
brew 'node'
brew 'ssh-copy-id'
brew 'tree'
brew 'rsync'

# Install Git and Related Tools.
brew 'git'
brew 'gist'
brew 'git-lfs'

# set arguments for all 'brew install --cask' commands
cask_args appdir: "/Applications", require_sha: true

# Install Additional Software
cask "adobe-acrobat-reader"
cask "alfred"
cask "amazon-workspaces"
cask "appcleaner"
cask "atom"
cask "brave-browser"
cask "caffeine"
cask "cakebrew"
cask "ccleaner"
cask "dash"
cask "dashlane"
cask "docker-toolbox"
cask "evernote"
cask "find-empty-folders"
cask "firefox"
cask "github-desktop"
cask "gitup"
cask "gpg-suite"
cask "iterm2"
cask "macdown"
cask "pingid"
cask "postman"
cask "rescuetime"
cask "sequel-pro"
cask "skitch"
cask "slack"
cask "sourcetree"
cask "sublime-text"
cask "virtualbox"
cask "vlc"
cask "vscodium"
cask "the-unarchiver"

# Mac Apple Store CLI more info @ https://github.com/mas-cli/mas. Login to APP Store before running this.
brew "mas"

# Install Mac Application Store Softwares.
# Microsoft Office
mas "Microsoft OneNote", id: 784801555
mas "Microsoft To Do", id: 1274495053

# Pocket ~ Offline Reader
mas "Pocket", id: 568494494

# 'whalebrew install'
brew whalebrew
whalebrew "whalebrew/wget"
